Revit 2027 API
PaperSizeSet.Erase Method
Removes a specified object from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	PaperSize item
)
Public Overridable Function Erase (
	item As PaperSize
) As Integer
public:
virtual int Erase(
	PaperSize^ item
)
abstract Erase :
        item : PaperSize -> int
override Erase :
        item : PaperSize -> int
Parameters
item PaperSize
The item to be erased.
Return Value
Int32
The number of items that were erased from the set.
See Also
Reference
PaperSizeSet Class
Autodesk.Revit.DB Namespace